Revit 2024 API
ViewSchedule.GetDefaultNameForViewList Method
 Gets the default view name that will be used when creating a view list.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public static string GetDefaultNameForViewList(
	Document document
)
Visual Basic
Public Shared Function GetDefaultNameForViewList ( _
	document As Document _
) As String
Visual C++
public:
static String^ GetDefaultNameForViewList(
	Document^ document
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document to which the new schedule will be added.
Return Value
 The default view name.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  document is not a project document.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace